grevaillot/svd_tools/headers/ATSAMV71N20/afec1.h
#define AFEC1_AFEC_TEMPCWR_TLOWTHRES_SHIFT		0
#define AFEC1_AFEC_TEMPCWR_TLOWTHRES_MASK		0xffff
/** @defgroup afec1_afec_tempcwr_tlowthres TLOWTHRES Temperature Low Threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup afec1_afec_acr AFECACR AFEC Analog Control Register
@{*/


#define AFEC1_AFEC_ACR_IBCTL_SHIFT		8
#define AFEC1_AFEC_ACR_IBCTL_MASK		0x03
/** @defgroup afec1_afec_acr_ibctl IBCTL AFE Bias Current Control
@{*/
/**@}*/

/** AFEC1_AFEC_ACR_PGA1EN PGA1 Enable **/
#define AFEC1_AFEC_ACR_PGA1EN		(1 << 3)
/** AFEC1_AFEC_ACR_PGA0EN PGA0 Enable **/
#define AFEC1_AFEC_ACR_PGA0EN		(1 << 2)

/**@}*/

/** @defgroup afec1_afec_shmr AFECSHMR AFEC Sample & Hold Mode Register
@{*/

/** AFEC1_AFEC_SHMR_DUAL11 Dual Sample & Hold for channel 11 **/
#define AFEC1_AFEC_SHMR_DUAL11		(1 << 11)
/** AFEC1_AFEC_SHMR_DUAL10 Dual Sample & Hold for channel 10 **/
#define AFEC1_AFEC_SHMR_DUAL10		(1 << 10)
/** AFEC1_AFEC_SHMR_DUAL9 Dual Sample & Hold for channel 9 **/
#define AFEC1_AFEC_SHMR_DUAL9		(1 << 9)
/** AFEC1_AFEC_SHMR_DUAL8 Dual Sample & Hold for channel 8 **/
#define AFEC1_AFEC_SHMR_DUAL8		(1 << 8)
/** AFEC1_AFEC_SHMR_DUAL7 Dual Sample & Hold for channel 7 **/
#define AFEC1_AFEC_SHMR_DUAL7		(1 << 7)
/** AFEC1_AFEC_SHMR_DUAL6 Dual Sample & Hold for channel 6 **/
#define AFEC1_AFEC_SHMR_DUAL6		(1 << 6)
/** AFEC1_AFEC_SHMR_DUAL5 Dual Sample & Hold for channel 5 **/
#define AFEC1_AFEC_SHMR_DUAL5		(1 << 5)
/** AFEC1_AFEC_SHMR_DUAL4 Dual Sample & Hold for channel 4 **/
#define AFEC1_AFEC_SHMR_DUAL4		(1 << 4)
/** AFEC1_AFEC_SHMR_DUAL3 Dual Sample & Hold for channel 3 **/
#define AFEC1_AFEC_SHMR_DUAL3		(1 << 3)
/** AFEC1_AFEC_SHMR_DUAL2 Dual Sample & Hold for channel 2 **/
#define AFEC1_AFEC_SHMR_DUAL2		(1 << 2)
/** AFEC1_AFEC_SHMR_DUAL1 Dual Sample & Hold for channel 1 **/
#define AFEC1_AFEC_SHMR_DUAL1		(1 << 1)
/** AFEC1_AFEC_SHMR_DUAL0 Dual Sample & Hold for channel 0 **/
#define AFEC1_AFEC_SHMR_DUAL0		(1 << 0)

/**@}*/

/** @defgroup afec1_afec_cosr AFECCOSR AFEC Correction Select Register
@{*/

/** AFEC1_AFEC_COSR_CSEL Sample & Hold unit Correction Select **/
#define AFEC1_AFEC_COSR_CSEL		(1 << 0)

/**@}*/

/** @defgroup afec1_afec_cvr AFECCVR AFEC Correction Values Register
@{*/


#define AFEC1_AFEC_CVR_GAINCORR_SHIFT		16
#define AFEC1_AFEC_CVR_GAINCORR_MASK		0xffff
/** @defgroup afec1_afec_cvr_gaincorr GAINCORR Gain Correction
@{*/
/**@}*/


#define AFEC1_AFEC_CVR_OFFSETCORR_SHIFT		0
#define AFEC1_AFEC_CVR_OFFSETCORR_MASK		0xffff
/** @defgroup afec1_afec_cvr_offsetcorr OFFSETCORR Offset Correction
@{*/
/**@}*/


/**@}*/

/** @defgroup afec1_afec_cecr AFECCECR AFEC Channel Error Correction Register
@{*/

/** AFEC1_AFEC_CECR_ECORR11 Error Correction Enable for channel 11 **/
#define AFEC1_AFEC_CECR_ECORR11		(1 << 11)
/** AFEC1_AFEC_CECR_ECORR10 Error Correction Enable for channel 10 **/
#define AFEC1_AFEC_CECR_ECORR10		(1 << 10)
/** AFEC1_AFEC_CECR_ECORR9 Error Correction Enable for channel 9 **/
#define AFEC1_AFEC_CECR_ECORR9		(1 << 9)
/** AFEC1_AFEC_CECR_ECORR8 Error Correction Enable for channel 8 **/
#define AFEC1_AFEC_CECR_ECORR8		(1 << 8)
/** AFEC1_AFEC_CECR_ECORR7 Error Correction Enable for channel 7 **/
#define AFEC1_AFEC_CECR_ECORR7		(1 << 7)
/** AFEC1_AFEC_CECR_ECORR6 Error Correction Enable for channel 6 **/
#define AFEC1_AFEC_CECR_ECORR6		(1 << 6)
/** AFEC1_AFEC_CECR_ECORR5 Error Correction Enable for channel 5 **/
#define AFEC1_AFEC_CECR_ECORR5		(1 << 5)
/** AFEC1_AFEC_CECR_ECORR4 Error Correction Enable for channel 4 **/
#define AFEC1_AFEC_CECR_ECORR4		(1 << 4)
/** AFEC1_AFEC_CECR_ECORR3 Error Correction Enable for channel 3 **/
#define AFEC1_AFEC_CECR_ECORR3		(1 << 3)
/** AFEC1_AFEC_CECR_ECORR2 Error Correction Enable for channel 2 **/
#define AFEC1_AFEC_CECR_ECORR2		(1 << 2)
/** AFEC1_AFEC_CECR_ECORR1 Error Correction Enable for channel 1 **/
#define AFEC1_AFEC_CECR_ECORR1		(1 << 1)
/** AFEC1_AFEC_CECR_ECORR0 Error Correction Enable for channel 0 **/
#define AFEC1_AFEC_CECR_ECORR0		(1 << 0)

/**@}*/

/** @defgroup afec1_afec_wpmr AFECWPMR AFEC Write Protection Mode Register
@{*/


#define AFEC1_AFEC_WPMR_WPKEY_SHIFT		8
#define AFEC1_AFEC_WPMR_WPKEY_MASK		0xffffff
/** @defgroup afec1_afec_wpmr_wpkey WPKEY Write Protect KEY
@{*/
/**@}*/

/** AFEC1_AFEC_WPMR_WPEN Write Protection Enable **/
#define AFEC1_AFEC_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup afec1_afec_wpsr AFECWPSR AFEC Write Protection Status Register
@{*/


#define AFEC1_AFEC_WPSR_WPVSRC_SHIFT		8
#define AFEC1_AFEC_WPSR_WPVSRC_MASK		0xffff
/** @defgroup afec1_afec_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** AFEC1_AFEC_WPSR_WPVS Write Protect Violation Status **/
#define AFEC1_AFEC_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup afec1_afec_version AFECVERSION AFEC Version Register
@{*/


#define AFEC1_AFEC_VERSION_MFN_SHIFT		16
#define AFEC1_AFEC_VERSION_MFN_MASK		0x07
/** @defgroup afec1_afec_version_mfn MFN Metal Fix Number
@{*/
/**@}*/


#define AFEC1_AFEC_VERSION_VERSION_SHIFT		0
#define AFEC1_AFEC_VERSION_VERSION_MASK		0xfff
/** @defgroup afec1_afec_version_version VERSION Version of the Hardware Module
@{*/
/**@}*/


/**@}*/
